---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.BalusterPattern
source: html/a4a53a0e-ab51-401a-1563-da90635f8cda.htm
---
# BalusterPattern Methods

Duplicates the baluster pointed by given index in the main baluster pattern.